CSI API ETABS v1

# eConstraintType Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eConstraintType

    Public Enumeration eConstraintType

    Dim instance As eConstraintType

    public enum class eConstraintType

    type eConstraintType

Members

| Member name| Value| Description
---|---|---|---
| Body| 1|
| Diaphragm| 2|
| Plate| 3|
| Rod| 4|
| Beam| 5|
| Equal| 6|
| Local| 7|
| Weld| 8|
| Line| 13|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com